import React from  'react';
import { withStyles, createStyles } from '@material-ui/core';
import Paper from '@material-ui/core/Paper';
import Img from '../images/20190314115321A5j1BfL2PxN9eDcz.jpeg';
const styles = () => createStyles({
   wrap: {
     width: '96%',
     margin: '0 auto',
     display: 'flex',
     flexDirection: 'column',
   },
   title: {
    padding: '14px 0 12px',
    color: '#000',
    fontSize: 24,
    fontWeight: 700,
    fontFamily: 'Arial,STHeiti,华文黑体,Microsoft YaHei,微软雅黑,SimSun,宋体,Helvetica,Tahoma,Arial sans-serif',
    marginBlockStart:'0.67em',
    marginBlockEnd: '0.67em',
    marginInlineStart: 0,
    marginInlineEnd: 0,
    fontWeight: 'bold',
   },
   img: {
       width: '100%',
   },
   ImgWrap: {
    margin: '6px  0',
   },
   content: {
    textIndent: 20,
    fontFamily: 'Arial,STHeiti,华文黑体,Microsoft YaHei,微软雅黑,SimSun,宋体,Helvetica,Tahoma,Arial sans-serif',
    lineHeight: 1.5,
    letterSpacing: 'normal',
    fontSize: 16,
    fontWeight: 'normal',
    textAlign: 'justify',
    color: '#363636',
   },
})
const PostShow = (props) => {
    const { classes } = props;
    return(
        <div className={classes.wrap}>
            <div className={classes.title}>
            休·杰克曼 2020 年重回百老汇，出演音乐剧《乐器推销员》
            </div>
            <div className={classes.ImgWrap}>
                <img src={Img} className={classes.img} />
            </div>
            <div className={classes.content}>
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            尽管休·杰克曼最广为人知的是《X 战警》中的“金刚狼”一角，但在那之前他的演艺事业是从澳大利亚的剧院舞台上开始的，而且是音乐剧
            </div>
        </div>
    )
}


export default withStyles(styles)(PostShow);